IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G1_EPWM27_CONTROLSS_G1_EPWM27.xml
	<register id="CONTROLSS_G1_EPWM27_ETCLR" acronym="CONTROLSS_G1_EPWM27_ETCLR" offset="0x154" width="16" description="Event Trigger Clear Register">
		<bitfield id="SOCB" width="1" begin="3" end="3" resetval="0x0" description="ePWM ADC Start-of-Conversion A [EPWMxSOCB] Flag Clear Bit   0: Writing a 0 has no effect. Always reads back a 0  1: Clears the ETFLG[SOCB] flag bit" range="3" rwaccess="R/W1TS"/> 
		<bitfield id="SOCA" width="1" begin="2" end="2" resetval="0x0" description="ePWM ADC Start-of-Conversion A [EPWMxSOCA] Flag Clear Bit   0: Writing a 0 has no effect. Always reads back a 0  1: Clears the ETFLG[SOCA] flag bit" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="ePWM Interrupt [EPWMx_INT] Flag Clear Bit   0: Writing a 0 has no effect. Always reads back a 0  1: Clears the ETFLG[INT] flag bit and enable further interrupts pulses to be generated" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G1_EPWM27_ETFRC" acronym="CONTROLSS_G1_EPWM27_ETFRC" offset="0x158" width="16" description="Event Trigger Force Register">
		<bitfield id="SOCB" width="1" begin="3" end="3" resetval="0x0" description="SOCB Force Bit  The SOCB pulse will only be generated if the event is enabled in the ETSEL register. The ETFLG[SOCB] flag bit will be set regardless.   0: Writing 0 to this bit will be ignored. Always reads back a 0.  1: Generates a pulse on EPWMxSOCB and set the SOCBFLG bit. This bit is used for test purposes." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="SOCA" width="1" begin="2" end="2" resetval="0x0" description="SOCA Force Bit  The SOCA pulse will only be generated if the event is enabled in the ETSEL register. The ETFLG[SOCA] flag bit will be set regardless.   0: Writing 0 to this bit will be ignored. Always reads back a 0.  1: Generates a pulse on EPWMxSOCA and set the SOCAFLG bit. This bit is used for test purposes." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="INT Force Bit  The interrupt will only be generated if the event is enabled in the ETSEL register. The INT flag bit will be set regardless.   0: Writing 0 to this bit will be ignored. Always reads back a 0.  1: Generates an interrupt on EPWMxINT and set the INT flag bit. This bit is used for test purposes." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G1_EPWM27_ETINTPS" acronym="CONTROLSS_G1_EPWM27_ETINTPS" offset="0x15C" width="16" description="Event-Trigger Interrupt Pre-Scale Register">
		<bitfield id="INTCNT2" width="4" begin="7" end="4" resetval="0x0" description="EPWMxINT Counter 2  When ETPS[INTPSSEL]=1, these bits indicate how many selected events have occurred:   0000: No events  0001: 1 event  0010: 2 events  0011: 3 events  0100: 4 events  ...  1111: 15 events" range="7 - 4" rwaccess="R"/> 
		<bitfield id="INTPRD2" width="4" begin="3" end="0" resetval="0x0" description="EPWMxINT Period 2 Select  When ETPS[INTPSSEL] = 1, these bits select how many selected events need to occur before an interrupt is generated:   0000: Disable counter  0001: Generate interrupt on INTCNT = 1 [first event]  0010: Generate interrupt on INTCNT = 2 [second event]  0011: Generate interrupt on INTCNT = 3 [third event]  0100: Generate interrupt on INTCNT = 4 [fourth event]  ...  1111: Generate interrupt on INTCNT = 15 [fifteenth event]" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM27_ETSOCPS" acronym="CONTROLSS_G1_EPWM27_ETSOCPS" offset="0x160" width="16" description="Event-Trigger SOC Pre-Scale Register">
		<bitfield id="SOCBCNT2" width="4" begin="15" end="12" resetval="0x0" description="EPWMxSOCB Counter 2  When ETPS[SOCPSSEL] = 1, these bits indicate how many selected events have occurred:   0000: No events  0001: 1 event  0010: 2 events  0011: 3 events  0100: 4 events  ...  1111: 15 events" range="15 - 12" rwaccess="R"/> 
		<bitfield id="SOCBPRD2" width="4" begin="11" end="8" resetval="0x0" description="EPWMxSOCB Period 2 Select  When ETPS[SOCPSSEL] = 1, these bits select how many selected event need to occur before an SOCB pulse is generated:   0000: Disable counter  0001: Generate interrupt on SOCBCNT2 = 1 [first event]  0010: Generate interrupt on SOCBCNT2 = 2 [second event]  0011: Generate interrupt on SOCBCNT2 = 3 [third event]  0100: Generate interrupt on SOCBCNT2 = 4 [fourth event]  ...  1111: Generate interrupt on SOCBCNT2 = 15 [fifteenth event]" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="SOCACNT2" width="4" begin="7" end="4" resetval="0x0" description="EPWMxSOCA Counter 2  When ETPS[SOCPSSEL] = 1, these bits indicate how many selected events have occurred:   0000: No events  0001: 1 event  0010: 2 events  0011: 3 events  0100: 4 events  ...  1111: 15 events" range="7 - 4" rwaccess="R"/> 
		<bitfield id="SOCAPRD2" width="4" begin="3" end="0" resetval="0x0" description="EPWMxSOCA Period 2 Select  When ETPS[SOCPSSEL] = 1, these bits select how many selected event need to occur before an SOCA pulse is generated:   0000: Disable counter  0001: Generate interrupt on SOCACNT2 = 1 [first event]  0010: Generate interrupt on SOCACNT2 = 2 [second event]  0011: Generate interrupt on SOCACNT2 = 3 [third event]  0100: Generate interrupt on SOCACNT2 = 4 [fourth event]  ...  1111: Generate interrupt on SOCACNT2 = 15 [fifteenth event]" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM27_ETCNTINITCTL" acronym="CONTROLSS_G1_EPWM27_ETCNTINITCTL" offset="0x164" width="16" description="Event-Trigger Counter Initialization Control Register">
		<bitfield id="SOCBINITEN" width="1" begin="15" end="15" resetval="0x0" description="EPWMxSOCB Counter 2 Initialization Enable   0: Has no effect.  1: Enable initialization of EPWMxSOCB counter with contents of ETCNTINIT[SOCBINIT] on a SYNC event or software force." range="15" rwaccess="R/W"/> 
		<bitfield id="SOCAINITEN" width="1" begin="14" end="14" resetval="0x0" description="EPWMxSOCA Counter 2 Initialization Enable   0: Has no effect.  1: Enable initialization of EPWMxSOCA counter with contents of ETCNTINIT[SOCAINIT] on a SYNC event or software force." range="14" rwaccess="R/W"/> 
		<bitfield id="INTINITEN" width="1" begin="13" end="13" resetval="0x0" description="EPWMxINT Counter 2 Initialization Enable   0: Has no effect.  1: Enable initialization of EPWMxINT counter 2 with contents of ETCNTINIT[INTINIT] on a SYNC event or software force." range="13" rwaccess="R/W"/> 
		<bitfield id="SOCBINITFRC" width="1" begin="12" end="12" resetval="0x0" description="EPWMxSOCB Counter 2 Initialization Force   0: Has no effect.  1: This bit forces the ET EPWMxSOCB counter to be initialized with the contents of ETCNTINIT[SOCBINIT]." range="12" rwaccess="R/W1TS"/> 
		<bitfield id="SOCAINITFRC" width="1" begin="11" end="11" resetval="0x0" description="EPWMxSOCA Counter 2 Initialization Force   0: Has no effect.  1: This bit forces the ET EPWMxSOCA counter to be initialized with the contents of ETCNTINIT[SOCAINIT]." range="11" rwaccess="R/W1TS"/> 
		<bitfield id="INTINITFRC" width="1" begin="10" end="10" resetval="0x0" description="EPWMxINT Counter 2 Initialization Force   0: Has no effect.  1: This bit forces the ET EPWMxINT counter to be initialized with the contents of ETCNTINIT[INTINIT]." range="10" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G1_EPWM27_ETCNTINIT" acronym="CONTROLSS_G1_EPWM27_ETCNTINIT" offset="0x168" width="16" description="Event-Trigger Counter Initialization Register">
		<bitfield id="SOCBINIT" width="4" begin="11" end="8" resetval="0x0" description="EPWMxSOCB Counter 2 Initialization Bits  The ET EPWMxSOCB counter is initialized with the contents of this register on an ePWM SYNC event or a software force." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="SOCAINIT" width="4" begin="7" end="4" resetval="0x0" description="EPWMxSOCA Counter 2 Initialization Bits  The ET EPWMxSOCA counter is initialized with the contents of this register on an ePWM SYNC event or a software force." range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="INTINIT" width="4" begin="3" end="0" resetval="0x0" description="EPWMxINT Counter 2 Initialization Bits  The ET EPWMxINT counter is initialized with the contents of this register on an ePWM SYNC event or a software force." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM27_ETINTMIXEN" acronym="CONTROLSS_G1_EPWM27_ETINTMIXEN" offset="0x16C" width="16" description="Event-Trigger Mixed INT Selection">
		<bitfield id="DCAEVT1" width="1" begin="10" end="10" resetval="0x0" description="Enable DCAEVT1.inter to the mixed ET interrupt trigger signal [ETINTMIX].    0: DCAEVT1.soc event is not enabled  1: Enable DCAEVT1.soc event" range="10" rwaccess="R/W"/> 
		<bitfield id="CDD" width="1" begin="9" end="9" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is decrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPD down-count match enable event is not enabled  1: Enable CMPD down-count match enable event" range="9" rwaccess="R/W"/> 
		<bitfield id="CDU" width="1" begin="8" end="8" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is incrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPD up-count match enable event is not enabled  1: Enable CMPD up-count match enable event" range="8" rwaccess="R/W"/> 
		<bitfield id="CCD" width="1" begin="7" end="7" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is decrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPC down-count match enable event is not enabled  1: Enable CMPC down-count match enable event" range="7" rwaccess="R/W"/> 
		<bitfield id="CCU" width="1" begin="6" end="6" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is incrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPC up-count match enable event is not enabled  1: Enable CMPC up-count match enable event" range="6" rwaccess="R/W"/> 
		<bitfield id="CBD" width="1" begin="5" end="5" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is decrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPB down-count match enable event is not enabled  1: Enable CMPB down-count match enable event" range="5" rwaccess="R/W"/> 
		<bitfield id="CBU" width="1" begin="4" end="4" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is incrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPB up-count match enable event is not enabled  1: Enable CMPB up-count match enable event" range="4" rwaccess="R/W"/> 
		<bitfield id="CAD" width="1" begin="3" end="3" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is decrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPA down-count match enable event is not enabled  1: Enable CMPA down-count match enable event" range="3" rwaccess="R/W"/> 
		<bitfield id="CAU" width="1" begin="2" end="2" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is incrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPA up-count match enable event is not enabled  1: Enable CMPA up-count match enable event" range="2" rwaccess="R/W"/> 
		<bitfield id="PRD" width="1" begin="1" end="1" resetval="0x1" description="Enable event time-base counter equal to period  [TBCTR = TBPRD] to the mixed ET interrupt trigger signal [ETINTMIX].    0: Period match event is not enabled  1: Enable period match event" range="1" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="1" begin="0" end="0" resetval="0x1" description="Enable event time-base counter equal to zero [TBCTR = 0x00] to the mixed ET interrupt trigger signal [ETINTMIX].    0: Zero match event is not enabled  1: Enable zero match event" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM27_ETSOCAMIXEN" acronym="CONTROLSS_G1_EPWM27_ETSOCAMIXEN" offset="0x170" width="16" description="Event-Trigger Mixed SOCA Selection">
		<bitfield id="DCAEVT1" width="1" begin="10" end="10" resetval="0x0" description="Enable DCAEVT1.inter to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: DCAEVT1.soc event is not enabled  1: Enable DCAEVT1.soc event" range="10" rwaccess="R/W"/> 
		<bitfield id="CDD" width="1" begin="9" end="9" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is decrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPD down-count match enable event is not enabled  1: Enable CMPD down-count match enable event" range="9" rwaccess="R/W"/> 
		<bitfield id="CDU" width="1" begin="8" end="8" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is incrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPD up-count match enable event is not enabled  1: Enable CMPD up-count match enable event" range="8" rwaccess="R/W"/> 
		<bitfield id="CCD" width="1" begin="7" end="7" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is decrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPC down-count match enable event is not enabled  1: Enable CMPC down-count match enable event" range="7" rwaccess="R/W"/> 
		<bitfield id="CCU" width="1" begin="6" end="6" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is incrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPC up-count match enable event is not enabled  1: Enable CMPC up-count match enable event" range="6" rwaccess="R/W"/> 
		<bitfield id="CBD" width="1" begin="5" end="5" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is decrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPB down-count match enable event is not enabled  1: Enable CMPB down-count match enable event" range="5" rwaccess="R/W"/> 
		<bitfield id="CBU" width="1" begin="4" end="4" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is incrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPB up-count match enable event is not enabled  1: Enable CMPB up-count match enable event" range="4" rwaccess="R/W"/> 
		<bitfield id="CAD" width="1" begin="3" end="3" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is decrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPA down-count match enable event is not enabled  1: Enable CMPA down-count match enable event" range="3" rwaccess="R/W"/> 
		<bitfield id="CAU" width="1" begin="2" end="2" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is incrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPA up-count match enable event is not enabled  1: Enable CMPA up-count match enable event" range="2" rwaccess="R/W"/> 
		<bitfield id="PRD" width="1" begin="1" end="1" resetval="0x1" description="Enable event time-base counter equal to period  [TBCTR = TBPRD] to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: Period match event is not enabled  1: Enable period match event" range="1" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="1" begin="0" end="0" resetval="0x1" description="Enable event time-base counter equal to zero [TBCTR = 0x00] to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: Zero match event is not enabled  1: Enable zero match event" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM27_ETSOCBMIXEN" acronym="CONTROLSS_G1_EPWM27_ETSOCBMIXEN" offset="0x174" width="16" description="Event-Trigger Mixed SOCB Selection">
		<bitfield id="DCBEVT1" width="1" begin="10" end="10" resetval="0x0" description="Enable DCBEVT1.inter to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: DCBEVT1.soc event is not enabled  1: Enable DCBEVT1.soc event" range="10" rwaccess="R/W"/> 
		<bitfield id="CDD" width="1" begin="9" end="9" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is decrementing to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: CMPD down-count match enable event is not enabled  1: Enable CMPD down-count match enable event" range="9" rwaccess="R/W"/> 
		<bitfield id="CDU" width="1" begin="8" end="8" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is incrementing to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: CMPD up-count match enable event is not enabled  1: Enable CMPD up-count match enable event" range="8" rwaccess="R/W"/> 
		<bitfield id="CCD" width="1" begin="7" end="7" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is decrementing to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: CMPC down-count match enable event is not enabled  1: Enable CMPC down-count match enable event" range="7" rwaccess="R/W"/> 
		<bitfield id="CCU" width="1" begin="6" end="6" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is incrementing to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: CMPC up-count match enable event is not enabled  1: Enable CMPC up-count match enable event" range="6" rwaccess="R/W"/> 
		<bitfield id="CBD" width="1" begin="5" end="5" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is decrementing to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: CMPB down-count match enable event is not enabled  1: Enable CMPB down-count match enable event" range="5" rwaccess="R/W"/> 
		<bitfield id="CBU" width="1" begin="4" end="4" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is incrementing to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: CMPB up-count match enable event is not enabled  1: Enable CMPB up-count match enable event" range="4" rwaccess="R/W"/> 
		<bitfield id="CAD" width="1" begin="3" end="3" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is decrementing to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: CMPA down-count match enable event is not enabled  1: Enable CMPA down-count match enable event" range="3" rwaccess="R/W"/> 
		<bitfield id="CAU" width="1" begin="2" end="2" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is incrementing to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: CMPA up-count match enable event is not enabled  1: Enable CMPA up-count match enable event" range="2" rwaccess="R/W"/> 
		<bitfield id="PRD" width="1" begin="1" end="1" resetval="0x1" description="Enable event time-base counter equal to period  [TBCTR = TBPRD] to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: Period match event is not enabled  1: Enable period match event" range="1" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="1" begin="0" end="0" resetval="0x1" description="Enable event time-base counter equal to zero [TBCTR = 0x00] to the mixed ET SOCB trigger signal [ETSOCBMIX].    0: Zero match event is not enabled  1: Enable zero match event" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM27_DCTRIPSEL" acronym="CONTROLSS_G1_EPWM27_DCTRIPSEL" offset="0x180" width="16" description="Digital Compare Trip Select Register">
		<bitfield id="DCBLCOMPSEL" width="4" begin="15" end="12" resetval="0x0" description="Digital Compare B Low Input Select Bits   0000: TRIPIN1  0001: TRIPIN2  0010: TRIPIN3  0011: TRIPIN4  ...  1011: TRIPIN12  1100: Reserved  1101: TRIPIN14  1110: TRIPIN15  1111: Trip combination input [all trip inputs selected by DCBLTRIPSEL register ORed together]" range="15 - 12" rwaccess="R/W"/> 
		<bitfield id="DCBHCOMPSEL" width="4" begin="11" end="8" resetval="0x0" description="Digital Compare B High Input Select Bits   0000: TRIPIN1  0001: TRIPIN2  0010: TRIPIN3  0011: TRIPIN4  ...  1011: TRIPIN12  1100: Reserved  1101: TRIPIN14  1110: TRIPIN15  1111: Trip combination input [all trip inputs selected by DCBHTRIPSEL register ORed together]" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="DCALCOMPSEL" width="4" begin="7" end="4" resetval="0x0" description="Digital Compare A Low Input Select Bits   0000: TRIPIN1  0001: TRIPIN2  0010: TRIPIN3  0011: TRIPIN4  ...  1011: TRIPIN12  1100: Reserved  1101: TRIPIN14  1110: TRIPIN15  1111: Trip combination input [all trip inputs selected by DCALTRIPSEL register ORed together]" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="DCAHCOMPSEL" width="4" begin="3" end="0" resetval="0x0" description="Digital Compare A High Input Select Bits   0000: TRIPIN1  0001: TRIPIN2  0010: TRIPIN3  0011: TRIPIN4  ...  1011: TRIPIN12  1100: Reserved  1101: TRIPIN14  1110: TRIPIN15  1111: Trip combination input [all trip inputs selected by DCAHTRIPSEL register ORed together]" range="3 - 0" rwaccess="R/W"/>
	</register>
